In [56]:
import pandas as pd
from typing import List

In [57]:
def createDataframe(student_data: List[List[int]]) -> pd.DataFrame:
    colume_names = ['student_id', 'age']
    result = pd.DataFrame(student_data, columns=colume_names)
    return result

In [58]:
student_data = [[1,15],[2,11],[3,11],[4,20]]

data_pd = createDataframe(student_data)

In [59]:
data_pd.shape

(4, 2)

In [60]:
data_pd.head(1)

   student_id  age
0           1   15

In [61]:
data_pd.loc[data_pd["student_id"]==4, ["age"]]

   age
3   20

In [62]:
data_pd['name'] = ['Liam', 'Joy', 'Andy', 'Smith']
data_pd

   student_id  age   name
0           1   15   Liam
1           2   11    Joy
2           3   11   Andy
3           4   20  Smith

In [63]:
data_pd.drop_duplicates(subset='age', keep='first', inplace=True)
data_pd

   student_id  age   name
0           1   15   Liam
1           2   11    Joy
3           4   20  Smith

In [64]:
data_pd.dropna(subset='name', inplace=True)
data_pd

   student_id  age   name
0           1   15   Liam
1           2   11    Joy
3           4   20  Smith

In [65]:
data_pd['age'] = data_pd['age']*2
data_pd

   student_id  age   name
0           1   30   Liam
1           2   22    Joy
3           4   40  Smith

In [66]:
data_pd = data_pd.rename(
    columns={
        'age':'newage',
        'name':'full_name'
    }
)
data_pd

   student_id  newage full_name
0           1      30      Liam
1           2      22       Joy
3           4      40     Smith

In [67]:
data_pd = data_pd.astype(
    {
        'newage':float
    }
)
data_pd

   student_id  newage full_name
0           1    30.0      Liam
1           2    22.0       Joy
3           4    40.0     Smith

In [68]:
data_pd = data_pd.rename(
    columns={
        'student_id' : 'id',
        'newage' : 'age',
        'full_name' : 'name'
    }
)

data_pd

   id   age   name
0   1  30.0   Liam
1   2  22.0    Joy
3   4  40.0  Smith

In [69]:
data_pd['grade'] = [5,3.3, None]
data_pd

   id   age   name  grade
0   1  30.0   Liam    5.0
1   2  22.0    Joy    3.3
3   4  40.0  Smith    NaN

In [70]:
data_pd['grade'].fillna(0)
data_pd

   id   age   name  grade
0   1  30.0   Liam    5.0
1   2  22.0    Joy    3.3
3   4  40.0  Smith    NaN

In [71]:
data_pd.at[3, 'grade'] = 3
data_pd

   id   age   name  grade
0   1  30.0   Liam    5.0
1   2  22.0    Joy    3.3
3   4  40.0  Smith    3.0

In [72]:
data_pd.loc[data_pd['age']==22, 'grade'] = 10
data_pd

   id   age   name  grade
0   1  30.0   Liam    5.0
1   2  22.0    Joy   10.0
3   4  40.0  Smith    3.0

In [73]:
data_pd.columns

Index(['id', 'age', 'name', 'grade'], dtype='object')

In [74]:
data1 = pd.DataFrame([[3,7,'Kid',20]], columns=data_pd.columns)
data1

   id  age name  grade
0   3    7  Kid     20

In [75]:
data_pd = pd.concat([data_pd, data1], axis=0)
data_pd

   id   age   name  grade
0   1  30.0   Liam    5.0
1   2  22.0    Joy   10.0
3   4  40.0  Smith    3.0
0   3   7.0    Kid   20.0

In [76]:
data_pd

   id   age   name  grade
0   1  30.0   Liam    5.0
1   2  22.0    Joy   10.0
3   4  40.0  Smith    3.0
0   3   7.0    Kid   20.0